# St7SetFrequencyPeriodTableType

Sets the type of the specified Factor vs Frequency/Period table.

Strand7 API Manual

long St7SetFrequencyPeriodTableType(long uID, long TableID, long FreqType)

Input Parameters

uID

Strand7 model file ID.

TableID

Table ID.

FreqType

Type of frequency table; either ftPeriod or ftFrequency.